scripts/load-test.yaml
---
settings:
  artifacts-dir: ./bzt-artifacts

execution:
  - concurrency: 10
    ramp-up: 10s
    hold-for: 60m
    scenario: simple

scenarios:
  simple:
    think-time: 0.2
    requests:
      - url: http://adi2go3c.mylabserver.com/api/ping1
      - url: http://adi2go3c.mylabserver.com/api/ping2
      - url: http://adi2go3c.mylabserver.com/api/ping3
      - url: http://adi2go3c.mylabserver.com/api/slow
      - url: http://adi2go3c.mylabserver.com/api/slow_randomly
      - url: http://adi2go3c.mylabserver.com/api/internal_error
      - url: http://adi2go3c.mylabserver.com/api/client_error
      - url: http://adi2go3c.mylabserver.com/api/error_randomly
      - url: http://adi2go3c.mylabserver.com/api/error_randomly_50